import re

class CustomRegex:
    @staticmethod
    def remove_diacritics(orig_text):
        # Define a mapping of characters to their replacements
        diacritics_map = {
            r'[áăắặằẳẵǎâấậầẩẫäǟȧǡạȁàảȃāąåǻḁⱥã]': 'a',
            r'[ÁĂẮẶẰẲẴǍÂẤẬẦẨẪÄǞȦǠẠȀÀẢȂĀĄÅǺḀȺÃ]': 'A',
            r'[ḃḅɓḇƀƃ]': 'b',
            r'[ḂḄƁḆɃƂ]': 'B',
            r'[ćčḉçĉċƈȼ]': 'c',
            r'[ĆČḈÇĈĊƇȻ]': 'C',
            r'[ďḑḓḋḍɗḏđƌǳǆ]': 'd',
            r'[ĎḐḒḊḌƊḎǲǅĐƋǱǄ]': 'D',
            r'[éĕěȩḝêếệềểễḙëėẹȅèẻȇēḗḕęɇẽḛ]': 'e',
            r'[ÉĔĚȨḜÊẾỆỀỂỄḘËĖẸȄÈẺȆĒḖḔĘɆẼḚ]': 'E',
            r'[ḟƒ]': 'f',
            r'[ḞƑ]': 'F',
            r'[ǵğǧģĝġɠḡǥ]': 'g',
            r'[ǴĞǦĢĜĠƓḠǤ]': 'G',
            r'[ḫȟḩĥⱨḧḣḥħ]': 'h',
            r'[ḪȞḨĤⱧḦḢḤĦ]': 'H',
            r'[ıíĭǐîïḯịȉìỉȋīįɨĩḭ]': 'i',
            r'[ÍĬǏÎÏḮİỊȈÌỈȊĪĮƗĨḬ]': 'I',
            r'[ǰĵɉ]': 'j',
            r'[ĴɈ]': 'J',
            r'[ḱǩķⱪḳƙḵ]': 'k',
            r'[ḰǨĶⱩḲƘḴ]': 'K',
            r'[ĺƚľļḽḷḹⱡḻŀł]': 'l',
            r'[ĹȽĽĻḼḶḸⱠḺĿǈŁ]': 'L',
            r'[ḿṁṃ]': 'm',
            r'[ḾṀṂ]': 'M',
            r'[ńňņṋṅṇǹɲṉƞñ]': 'n',
            r'[ŃŇŅṊṄṆǸƝṈȠǋÑ]': 'N',
            r'[óŏǒôốộồổỗöȫȯȱọőȍòỏơớợờởỡȏōṓṑǫǭøǿõṍṏȭ]': 'o',
            r'[ÓŎǑÔỐỘỒỔỖÖȪȮȰỌŐȌÒỎƠỚỢỜỞỠȎŌṒṐǪǬØǾÕṌṎȬ]': 'O',
            r'[ṕṗƥᵽ]': 'p',
            r'[ṔṖƤⱣ]': 'P',
            r'[ɋ]': 'q',
            r'[Ɋ]': 'Q',
            r'[ŕřŗṙṛṝȑȓṟɍɽ]': 'r',
            r'[ŔŘŖṘṚṜȐȒṞɌⱤ]': 'R',
            r'[śṥšṧşŝșṡṣṩ]': 's',
            r'[ŚṤŠṦŞŜȘṠṢṨ]': 'S',
            r'[ťţṱțẗⱦṫṭƭṯʈŧ]': 't',
            r'[ŤŢṰȚȾṪṬƬṮƮŦ]': 'T',
            r'[ʉúŭǔûṷüǘǚǜǖṳụűȕùủưứựừửữȗūṻųůũṹṵ]': 'u',
            r'[ɄÚŬǓÛṶÜǗǙǛǕṲỤŰȔÙỦƯỨỰỪỬỮȖŪṺŲŮŨṸṴ]': 'U',
            r'[ṿʋṽ]': 'v',
            r'[ṾƲṼ]': 'V',
            r'[ẃŵẅẇẉẁⱳẘ]': 'w',
            r'[ẂŴẄẆẈẀⱲ]': 'W',
            r'[ẍẋ]': 'x',
            r'[ẌẊ]': 'X',
            r'[ýŷÿẏỵỳƴỷȳẙɏỹ]': 'y',
            r'[ÝŶŸẎỴỲƳỶȲɎỸ]': 'Y',
            r'[ǽǣæ]': 'ae',
            r'[ǼǢÆ]': 'AE',
            r'[Þ]': 'th',
            r'[þ]': 'th',
            r'[ß]': 'ss',
            r'[ß]': 'SS',
            r'[źžẑⱬżẓȥẕƶ]': 'z',
            r'[ŹŽẐⱫŻẒȤẔƵ]': 'Z',
            r'[œ]': 'oe',
            r'[Œ]': 'OE',
            r'[ð]': 'dj',
            r'[Ð]': 'DJ',
            r'[ĳ]': 'ij',
            r'[Ĳ]': 'IJ',
            r'[ǉ]': 'lj',
            r'[Ǉ]': 'LJ',
            r'[ǌ]': 'nj',
            r'[Ǌ]': 'NJ',
            r'[★]': '*'
        }

        # Perform replacements
        for pattern, replacement in diacritics_map.items():
            orig_text = re.sub(pattern, replacement, orig_text)

        return orig_text

    @staticmethod
    def get_only_numbers(orig_text):
        # Use regex to find the first occurrence of digits
        match = re.search(r"\d+", orig_text)
        return match.group() if match else ""
